""" Надрукувати текст "Hello, World!" у консоль """

# print('Hello, World!')
#
#  # or
#
# my_string = 'Hello, World!'
# print(my_string)

""" Дано ціле число n, виконати такі умовні дії:
- Якщоє n непарним, друк Weird
- Якщоє n є парним і в інклюзивному діапазоні 2 до 5, роздрукувати Not Weird
- Якщоє n є парним і в інклюзивному діапазоні 6 до 20, роздрукувати Weird
- Якщоє n є парним і більшим за 20, роздрукувати Not Weird """


# def function(n):
#     if n % 2 == 1:
#         print('Weird')
#     elif n % 2 == 0 and 2 <= n <= 5:
#         print('Not Weird')
#     elif n % 2 == 0 and 6 <= n <= 20:
#         print('Weird')
#     else:
#         print('Not Weird')
#
# if __name__ == '__main__':
#     n = int(input().strip())
#     function(n)

""" Наданий фрагмент коду зчитує два цілі числа з STDIN a і b . Додайте код для друку трьох 
рядків, де:
- Перший рядок містить суму двох чисел.
- У другому рядку міститься різниця двох чисел (перше – друге).
- Третій рядок містить добуток двох чисел. """

# def function(a, b):
#     print(a + b)
#     print(a - b)
#     print(a * b)
#
# if __name__ == '__main__':
#     a = int(input())
#     b = int(input())
#
#     function(a, b)

""" Наданий фрагмент коду читає два цілі числа, a і b, від STDIN.
Додайте логіку для друку двох рядків. Перший рядок повинен містити результат цілочисельного 
ділення, a//b. Другий рядок повинен містити результат ділення з плаваючою точкою, a/b.
Округлення чи форматування не потрібні."""

# def function(a, b):
#     print(a//b)
#     print(a/b)
#
# if __name__ == '__main__':
#     a = int(input())
#     b = int(input())
#     function(a, b)

""" Наданий код зчитує ціле число, n з STDIN. Для всіх невід’ємних цілих чисел i<n виведіть  
print t в квадраті . """

# def function(n):
#     for i in range(n):
#         print(i**2)
#
# if __name__ == '__main__':
#     n = int(input())
#     function(n)

""" Код буде читати ціле число, n, з STDIN. Не використовуючи методів рядків, спробуйте 
надрукувати наступне: 123...n. Зверніть увагу, що "..." представляє послідовні значення між ними."""

# def function(n):
#     for i in range(1, n+1):
#         print(i, end='')
#
# if __name__ == '__main__':
#     n = int(input())
#     function(n)

""" Майже кожні чотири роки до календаря додається додатковий день, як 29 лютого, і цей день  
називається високосним. Він виправляє календар на той факт, що наша планета обертається навколо  
Сонця за приблизно 365,25 днів. Високосний рік містить високосний день.
У григоріанському календарі для визначення високосних років використовуються три умови:
- Рік можна порівну розділити на 4, є високосним, якщо:
- Рік можна порівну поділити на 100, це НЕ високосний рік, якщо:
- Рік також рівномірно ділиться на 400. Тоді це високосний рік.
Це означає, що в григоріанському календарі 2000 і 2400 роки є високосними,  тоді як 1800, 1900, 
2100, 2200, 2300 і 2500 роки НЕ є високосними. 
За даним роком визначте, чи є він високосним. Якщо це високосний рік, поверніть логічне значення 
True, інакше поверніть False. Зауважте, що надана заглушка коду зчитує стандартний номер  
стандартного номера та передає аргументи функції is_leap. Потрібно лише виконати функцію is_leap."""

def is_leap(year):
    leap = False
    if year % 4 == 0:
        leap = True
        if year % 100 == 0:
            leap = False
            if year % 400 == 0:
                leap = True

    return leap


year = int(input())
print(is_leap(year))