import socket

"""
Оголошується функція echo_client, яка призначена для підключення до сервера. 
Вона має два параметри: server_host (адреса сервера) та server_port (порт сервера).
"""
def echo_client(server_host='127.0.0.1', server_port=6000):

    """"Створюється сокет з використанням IPv4 (AF_INET) і TCP протоколу (SOCK_STREAM). 
    Контекстний менеджер with гарантує, що сокет буде правильно закритий після завершення роботи з ним."""""
    with socket.socket(socket.AF_INET, socket.SOCK_STREAM) as s:

        """"Сокет підключається до сервера за вказаною адресою та портом."""
        s.connect((server_host, server_port))

        """"Клієнт відправляє повідомлення серверу. b перед рядком означає, 
        що дані відправляються у бінарному форматі."""
        s.sendall(b'Hello, server')

        """"Клієнт отримує відповідь від сервера. 1024 - це розмір буфера у байтах для отримання даних."""
        data = s.recv(1024)
        print('Received', repr(data))


if __name__ == "__main__":
    echo_client()
