import socket

"""
Тут ми визначаємо функцію echo_server, яка буде запускати наш сервер. 
Вона приймає два параметри: host (IP-адреса, на якій буде працювати сервер) 
та port (порт, на якому буде слухати сервер).
"""
def echo_server(host='127.0.0.1', port=6000):

    """"У цьому рядку створюється новий сокет за допомогою контекстного менеджера with. 
    AF_INET вказує, що ми використовуємо мережу IPv4, 
    а SOCK_STREAM означає, що ми використовуємо TCP для з'єднання."""""
    with socket.socket(socket.AF_INET, socket.SOCK_STREAM) as s:

        """Ми прив'язуємо сокет до заданого хоста та порту."""
        s.bind((host, port))

        """Ми викликаємо метод listen, щоб сокет почав слухати вхідні з'єднання."""
        s.listen()

        print(f"Server started at {host}:{port}")

        """Цей рядок блокує виконання програми, поки сокет не отримає вхідне з'єднання. 
        conn - це новий сокет, який використовується для комунікації з клієнтом. 
        addr - це адреса клієнта."""
        conn, addr = s.accept()

        """Використання ще одного контекстного менеджера для обробки з'єднання."""
        with conn:
            print(f"Connected by {addr}")

            """Починається нескінченний цикл, де сервер безперервно чекає на дані від клієнта."""
            while True:

                """Сервер читає дані, які відправив клієнт. 1024 - це розмір буфера в байтах."""
                data = conn.recv(1024)

                """Перевіряємо, чи є дані для читання."""
                if not data:
                    break

                """Відправляємо отримані дані назад клієнту."""
                conn.sendall(data)


if __name__ == "__main__":
    echo_server()
